function matchPhones(input) {
    let pattern = /\+359([ -])2\1\d{3}\1\d{4}\b/g;
    // +359 - валидния номер трябва да започва с +359
    // ([ -]) - след номера трябва да има или спейс или тире
    // 2 - следващия елемент е двойка
    // \1 - ако си започнал с тирета докрая го караш с тирета
    // d{3} - разделение на група от три символа
    // d{4} - разделение от по 4
    // \b - граница на номера
    let text = input.shift();

    let result = text.match(pattern)

    console.log(result.join(', '));
}

matchPhones(['+359 2 222 2222,359-2-222-2222, +359/2/222/2222, +359-2 222 2222 +359 2-222-2222, +359-2-222-222, +359-2-222-22222 +359-2-222-2222']);